// AboutUs.js

import React from 'react';
import './AboutUs.css'; // Импорт на CSS файла

const AboutUs = () => {
  return (
    <div className="about-us-container">
      <div className="about-us-content">
        <div className="about-us-text">
          <h2>Добре дошли в MOVIES APP!</h2>
          <p>
            <span>Историята ни:</span> Нашата страст към филмите и убеждението, че всяко киноизкуство заслужава да бъде открито и споделено, доведе до създаването на нашето приложение. Започнахме с идеята да създадем място, където любителите на филмите от всякакви жанрове и култури могат да открият нови филми, да споделят своите преживявания и да се вдъхновяват един от друг.
            <br/><br/>
            <span>Екипът ни:</span> Ние сме група от страстни фенове на киното, разработчици и дизайнери, които работят усърдно, за да осигурим най-доброто потребителско изживяване. Нашата разнообразна екипна динамика и културно разнообразие ни вдъхновява да търсим постоянни иновации и подобрения, които да вървят ръка за ръка с нуждите на нашите потребители.
            <br/><br/>
            <span>Уникални характеристики:</span> Нашето приложение предлага не само огромна колекция от филми, но и персонализирани препоръки, базирани на вашите предпочитания. Допълнително, можете да се включите в общността ни, да споделите свои рецензии, да оценявате филми и да откриете какво гледат други потребители.
            <br/><br/>
            <span>Потребителско изживяване:</span> Ние вярваме, че всяко изживяване с филми е уникално. Следователно, сме се постарали да направим приложението си интуитивно и лесно за използване, за да можете да се насладите на вашите любими филми по начина, по който предпочитате.
            <br/><br/>
            <span>Бъдещи планове и развитие:</span> Нашата цел е да продължим да подобряваме приложението си, като добавяме нови функции и усъвършенстваме вече съществуващите. Планираме да въведем нови интерактивни функции и разширения нашата филмова общност, за да направим вашият опит с нас още по-вълнуващ.
          </p>
        </div>
        <div className="about-us-image">
          <img src="https://img.freepik.com/premium-vector/cinema-movie-background-popcorn-filmstrip-clapboard-tickets-movie-time-background_41737-248.jpg?w=740" alt="Movies" />
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
